МобильноеПриложение/src/Catalogs/НаборыУслуг/НаборыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыУслуг</name>
  <owners>Catalog.Адреса</owners>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

МобильноеПриложение/src/Catalogs/Поставщики/Поставщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Поставщики</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Учитываемая единица измерения</comment>
      <type>
        <types>EnumRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МобильноеПриложение/src/Catalogs/НаборыУслуг/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеДанных");
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокПоставщиков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	ОбновитьСписокПоставщиков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервере
Процедура ОбновитьСписокПоставщиков()
	Перем МассивПоставщиков;
	Перем ВыборкаДетальныеЗаписи;
	Перем Запрос;
	Перем РезультатЗапроса;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоставщикиОказываемыеУслуги.Ссылка
		|ИЗ
		|	Справочник.Поставщики.ОказываемыеУслуги КАК ПоставщикиОказываемыеУслуги
		|ГДЕ
		|	ПоставщикиОказываемыеУслуги.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивПоставщиков = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПоставщиков.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Элементы.Поставщик.РежимВыбораИзСписка = Истина;
	Элементы.Поставщик.СписокВыбора.Очистить();
	Элементы.Поставщик.СписокВыбора.ЗагрузитьЗначения(МассивПоставщиков);
КонецПроцедуры

#КонецОбласти
